; domain
(define (domain hamiltonian-cycle)
  (:requirements :strips :typing :equality :negative-preconditions)
  (:types vertex count)
  (:predicates
    (connected ?v1 ?v2 - vertex)       ; there is an edge between v1 and v2
    (visited ?v - vertex)              ; vertex v has been visited
    (current ?v - vertex)              ; current position in the path
    (start ?v - vertex)                ; starting vertex
    (start-selected)                   ; indicates if start vertex has been selected
    (path-length ?n - count)           ; number of vertices visited so far
    (next ?n1 ?n2 - count)             ; successor relation for counts
    (total-vertices ?n - count)        ; total number of vertices in the graph
    (back-at-start)                    ; true when we're back at start vertex
  )
  
  (:action select-start
    :parameters (?v - vertex ?zero ?one - count)
    :precondition (and 
      (not (start-selected))           ; no start vertex selected yet
      (path-length ?zero)              ; path length is zero
      (next ?zero ?one)                ; one is the successor of zero
    )
    :effect (and
      (start ?v)                       ; mark as start vertex
      (start-selected)                 ; mark that a start vertex has been selected
      (current ?v)                     ; set as current position
      (visited ?v)                     ; mark as visited
      (not (path-length ?zero))        ; update path length
      (path-length ?one)               ; path length is now one
    )
  )
  
  (:action move-to-next
    :parameters (?from ?to - vertex ?n1 ?n2 - count)
    :precondition (and
      (current ?from)                 ; we are at vertex "from"
      (connected ?from ?to)           ; there is an edge from "from" to "to"
      (not (visited ?to))             ; "to" hasn't been visited yet
      (path-length ?n1)               ; current path length
      (next ?n1 ?n2)                  ; n2 is successor of n1
    )
    :effect (and
      (not (current ?from))           ; no longer at "from"
      (current ?to)                   ; now at "to"
      (visited ?to)                   ; mark "to" as visited
      (not (path-length ?n1))         ; update path length
      (path-length ?n2)               ; increment path length
    )
  )
  
  (:action complete-cycle
    :parameters (?last ?first - vertex ?n - count)
    :precondition (and
      (current ?last)                 ; we are at vertex "last"
      (start ?first)                  ; "first" is the start vertex
      (connected ?last ?first)        ; there is an edge from "last" to "first"
      (path-length ?n)                ; current path length
      (total-vertices ?n)             ; all vertices have been visited
    )
    :effect (and
      (not (current ?last))           ; no longer at "last"
      (current ?first)                ; back at "first"
      (back-at-start)                 ; mark that we're back at start
    )
  )
)

; problem
(define (problem hamiltonian-example)
  (:domain hamiltonian-cycle)
  
  (:objects
    v1 v2 v3 v4 v5 - vertex
    n0 n1 n2 n3 n4 n5 - count
  )
  
  (:init
    ; Define the graph structure (edges)
    (connected v1 v3)
    (connected v3 v1)
    (connected v1 v5)
    (connected v5 v1)
    (connected v2 v3)
    (connected v3 v2)
    (connected v2 v4)
    (connected v4 v2)
    (connected v2 v5)
    (connected v5 v2)
    (connected v3 v4)
    (connected v4 v3)
    (connected v3 v5)
    (connected v5 v3)
    
    ; Define the count sequence for tracking path length
        (next n0 n1)
    (next n1 n2)
    (next n2 n3)
    (next n3 n4)
    (next n4 n5)
    
    ; Initial path length is zero
    (path-length n0)
    
    ; No start vertex selected yet
    (not (start-selected))
    
    ; Total number of vertices
    (total-vertices n5)
  )
  
  (:goal
    (and
      ; We've returned to the start vertex
      (back-at-start)
      
      ; All vertices have been visited
      (visited v1)
      (visited v2)
      (visited v3)
      (visited v4)
      (visited v5)
      
      ; Path length equals total vertices
      (path-length n5)
    )
  )
)

; plan
1. (select-start v5 n0 n1)
   deleted: (path-length n0)
   added: (start v5) (start-selected) (current v5) (visited v5) (path-length n1)
   goals met: 1 of 7
2. (move-to-next v5 v1 n1 n2)
   deleted: (current v5) (path-length n1)
   added: (current v1) (visited v1) (path-length n2)
   goals met: 2 of 7
3. (move-to-next v1 v3 n2 n3)
   deleted: (current v1) (path-length n2)
   added: (current v3) (visited v3) (path-length n3)
   goals met: 3 of 7
4. (move-to-next v3 v4 n3 n4)
   deleted: (current v3) (path-length n3)
   added: (current v4) (visited v4) (path-length n4)
   goals met: 4 of 7
5. (move-to-next v4 v2 n4 n5)
   deleted: (current v4) (path-length n4)
   added: (current v2) (visited v2) (path-length n5)
   goals met: 6 of 7
6. (complete-cycle v2 v5 n5)
   deleted: (current v2)
   added: (current v5) (back-at-start)
   goals met: 7 of 7
